# DpartLengthComputed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartLengthComputed Property
ParameterTypeId Class See Also
---
"Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartLengthComputed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartLengthComputed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartLengthComputed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace